rm(list = ls())

setwd("/home/william/Documents/myCTP")

## =============================================================================
suppressWarnings(
    suppressMessages(
        source("./conf/Rconf/myInit.R")
    )
)
## =============================================================================

## =============================================================================
## 获取交易的价格数据
## -----------------------------------------------------------------------------
mysql <- mysqlFetch('YY_SimNow', host = '192.168.1.166')
dtOrder <- dbGetQuery(mysql,"
        select * from tradingInfo
        where TradingDay = 20170822
    ") %>%  as.data.table() %>% 
    .[, ':='(
        TradingDay = as.Date(TradingDay),
        offset     = iconv(offset, from = 'GB18030', to = 'utf8') 
        )]
## =============================================================================

## =============================================================================
## 获取 bar 数据
## -----------------------------------------------------------------------------
mysql <- mysqlFetch('china_futures_bar', host = '192.168.1.166')
dtDaily <- dbGetQuery(mysql, "
        select TradingDay,InstrumentID,
               OpenPrice, HighPrice, LowPrice, ClosePrice
        from daily
        where TradingDay = 20170822
        and sector = 'allday'
    ") %>% as.data.table() %>% 
    .[, ":="(
        TradingDay = as.Date(TradingDay))]
## =============================================================================

## =============================================================================
## 对比数据
## 1. 如果是 开仓，以 OpenPrice 作为对比标准
## 2. 如果是 平仓，以 ClosePrice 作为对比标准
## -----------------------------------------------------------------------------
dt <- merge(dtOrder, dtDaily, all.x = TRUE, by = c('InstrumentID','TradingDay'))
for (i in 1:nrow(dt)) {
    ## -------------------------------------------------------------------------
    if (dt[i, offset == '开仓']) {
        dt[i, err := (price - OpenPrice) / OpenPrice]
    } else {
        dt[i, err := (price - ClosePrice) / ClosePrice]
    } 
    ## -------------------------------------------------------------------------
}
dt[, err := round(err,3)]
## =============================================================================


## =============================================================================
## 结果分析
## -----------------------------------------------------------------------------
## 多开，应该少 .002
dt[direction == 'long'][offset == '开仓']

## 空开, 应该多 .002
dt[direction == 'short'][offset == '开仓']

dt[offset == '平仓']
## =============================================================================
